import Image from 'next/image'
import React from 'react'
import about from '../../../assets/about.png'


function SectionAbout() {
    return (
        <div className=''>
            <div className='bg-gray-100'>

                <div className='p-4 md:p-20 text-gray-900'>
                    <Image src={about} alt='aboutimag' width='400' className='float-left pr-10 h-[300px] pb-4 grayscale hidden md:block '></Image>

                    <p className='sm:text-left text-2xl md:text-6xl pb-4 md:pl-[20%] uppercase'>Rampuriwale Dadaji</p>
                    <Image src={about} alt='aboutimag' width='400' className='float-left md:pr-10 h-[300px] pb-4 grayscale md:hidden visible'></Image>
                    परम पूज्य गुरुदेव रामपुरी वाले दादाजी एक संत और दिव्य महात्मा थे, जिनका जीवन अत्यंत सरल, सहज और सेवा भाव से भरा हुआ था। उनका जन्म मध्यप्रदेश के खंडवा जिले के ग्राम रामपुरी में एक ब्राह्मण परिवार में हुआ था। बचपन से ही उन्होंने अपना जीवन प्रभु भक्ति में समर्पित कर दिया और वे एक ब्रह्मचारी के रूप में जीवन जीते रहे। उनके जीवन का एकमात्र लक्ष्य दूसरों की सेवा करना था, और इसी को उन्होंने अपना ध्येय बना लिया।

                    सन् 1980 के आसपास गुरुदेव हमारे गांव बोथिया में पधारे, और उनके आगमन से हमारा गांव धन्य हो गया। उनके मन में हर जीव के प्रति करुणा और प्रेम था, चाहे वह कोई इंसान हो या कोई बेजुबान पशु-पक्षी। गुरुदेव का जीवन दूसरों की सेवा को समर्पित था, और यही उनके साधना और भक्ति का आधार था। उनके लिए हर प्राणी समान था, और उन्होंने कभी किसी के साथ भेदभाव नहीं किया।

                    गुरुदेव अपने भोजन और दिनचर्या का ध्यान खुद रखते थे। वे अपने हाथों से भोजन बनाते, जिसमें प्रायः प्याज की सब्जी और चार छोटे-छोटे टिक्कड़ बनाते थे। वे खुद बहुत कम भोजन करते और बाकी किसी भी भूखे जीव को, चाहे वह इंसान हो या पशु, खिला देते थे। अपने वस्त्र भी वे स्वयं ही धोते थे और अपनी पोटली को किसी को छूने नहीं देते थे। उनकी पोटली में उनके कुछ कपड़े, उनके भगवान की तस्वीर और कहीं से मिला हुआ थोड़ा-बहुत दान रखा होता था।

                    गुरुदेव की दिव्यता का बहुत कम लोग जीवित रहते हुए अनुभव कर पाए। उनका जीवन सादगी और तपस्या का अद्वितीय उदाहरण था। लोग कहते हैं कि वे कभी किसी को रास्ते में नहीं मिले; वे हमेशा किसी गांव के समीप ही दिखाई देते थे। यह भी माना जाता था कि उन्हें किसी भी असाधारण घटना का पूर्वाभास हो जाता था।

                    उनके अद्वितीय जीवन, निस्वार्थ सेवा और दिव्यता ने सभी के दिलों में गहरी छाप छोड़ी है। उनका जीवन हम सभी के लिए एक प्रेरणा है, और उनकी सादगी, सेवा और करुणा की गूंज सदैव हमारे दिलों में जीवित रहेगी।
                </div>
            </div>
        </div>

    )
}

export default SectionAbout
